app/controllers/monitoring_apps_controller.rb

  def show
    @monitoring_app = MonitoringApp.find(params[:id])
---
SELECT "monitoring_apps".* FROM "monitoring_apps" WHERE "monitoring_apps"."id" = ? LIMIT 1  [["id", "showhosts"]]